main/Enums/ПериодыОтображенияКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ПериодыОтображенияКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/CommonModules/РаботаСКалендаремКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьДатуНачалаПериодичностиПланировщика(ПериодичностьПланировщика, Дата) Экспорт
	
	ДатаНачалаПериода = Неопределено;
	
	Если ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.День") Тогда
		
		ДатаНачалаПериода = НачалоДня(Дата);
		
	ИначеЕсли ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.Неделя") Тогда
		
		ДатаНачалаПериода = НачалоНедели(Дата);
		
	ИначеЕсли ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.Месяц") Тогда
		
		ДатаНачалаПериода = НачалоНедели(НачалоМесяца(Дата));
		
	ИначеЕсли ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.Год") Тогда
		
		ДатаНачалаПериода = НачалоГода(Дата);
		
	КонецЕсли;
	
	Возврат ДатаНачалаПериода;
	
КонецФункции

Функция ПолучитьДатуОкончанияПериодичностиПланировщика(ПериодичностьПланировщика, Дата) Экспорт
	
	ДатаОкончанияПериода = Неопределено;
	
	Если ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.День") Тогда
		
		ДатаОкончанияПериода = КонецДня(Дата);
		
	ИначеЕсли ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.Неделя") Тогда
		
		ДатаОкончанияПериода = КонецНедели(Дата);
		
	ИначеЕсли ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.Месяц") Тогда
		
		ДатаОкончанияПериода = КонецНедели(КонецМесяца(Дата));
		
	ИначеЕсли ПериодичностьПланировщика = ПредопределенноеЗначение("Перечисление.ПериодыОтображенияКалендаря.Год") Тогда
		
		ДатаОкончанияПериода = КонецГода(Дата);	
		
	КонецЕсли;
	
	Возврат ДатаОкончанияПериода;
	
КонецФункции

#КонецОбласти
